AlmAck/svdtonuttx/demo/h/da1470_dma.h
/****************************************************************************
 * ./tmp/da1470_dma.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470_DMA_H
#define __DA1470_DMA_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470_DMA_DMA0_A_START_OFFSET        0x0000 /* Source address register of DMA channel 0 */
#define DA1470_DMA_DMA0_B_START_OFFSET        0x0004 /* Destination address register of DMA channel 0 */
#define DA1470_DMA_DMA0_CTRL_OFFSET           0x0010 /* Control register of DMA channel 0 */
#define DA1470_DMA_DMA0_IDX_OFFSET            0x0014 /* Index pointer register of DMA channel 0 */
#define DA1470_DMA_DMA0_INT_OFFSET            0x0008 /* Interrupt length register of DMA channel 0 */
#define DA1470_DMA_DMA0_LEN_OFFSET            0x000C /* Transfer length register of DMA channel 0 */
#define DA1470_DMA_DMA1_A_START_OFFSET        0x0020 /* Source address register of DMA channel 1 */
#define DA1470_DMA_DMA1_B_START_OFFSET        0x0024 /* Destination address register of DMA channel 1 */
#define DA1470_DMA_DMA1_CTRL_OFFSET           0x0030 /* Control register of DMA channel 1 */
#define DA1470_DMA_DMA1_IDX_OFFSET            0x0034 /* Index pointer register of DMA channel 1 */
#define DA1470_DMA_DMA1_INT_OFFSET            0x0028 /* Interrupt length register of DMA channel 1 */
#define DA1470_DMA_DMA1_LEN_OFFSET            0x002C /* Transfer length register of DMA channel 1 */
#define DA1470_DMA_DMA2_A_START_OFFSET        0x0040 /* Source address register of DMA channel 2 */
#define DA1470_DMA_DMA2_B_START_OFFSET        0x0044 /* Destination address register of DMA channel 2 */
#define DA1470_DMA_DMA2_CTRL_OFFSET           0x0050 /* Control register of DMA channel 2 */
#define DA1470_DMA_DMA2_IDX_OFFSET            0x0054 /* Index pointer register of DMA channel 2 */
#define DA1470_DMA_DMA2_INT_OFFSET            0x0048 /* Interrupt length register of DMA channel 2 */
#define DA1470_DMA_DMA2_LEN_OFFSET            0x004C /* Transfer length register of DMA channel 2 */
#define DA1470_DMA_DMA3_A_START_OFFSET        0x0060 /* Source address register of DMA channel 3 */
#define DA1470_DMA_DMA3_B_START_OFFSET        0x0064 /* Destination address register of DMA channel 3 */
#define DA1470_DMA_DMA3_CTRL_OFFSET           0x0070 /* Control register of DMA channel 3 */
#define DA1470_DMA_DMA3_IDX_OFFSET            0x0074 /* Index pointer register of DMA channel 3 */
#define DA1470_DMA_DMA3_INT_OFFSET            0x0068 /* Interrupt length register of DMA channel 3 */
#define DA1470_DMA_DMA3_LEN_OFFSET            0x006C /* Transfer length register of DMA channel 3 */
#define DA1470_DMA_DMA4_A_START_OFFSET        0x0080 /* Source address register of DMA channel 4 */
#define DA1470_DMA_DMA4_B_START_OFFSET        0x0084 /* Destination address register of DMA channel 4 */
#define DA1470_DMA_DMA4_CTRL_OFFSET           0x0090 /* Control register of DMA channel 4 */
#define DA1470_DMA_DMA4_IDX_OFFSET            0x0094 /* Index pointer register of DMA channel 4 */
#define DA1470_DMA_DMA4_INT_OFFSET            0x0088 /* Interrupt length register of DMA channel 4 */
#define DA1470_DMA_DMA4_LEN_OFFSET            0x008C /* Transfer length register of DMA channel 4 */
#define DA1470_DMA_DMA5_A_START_OFFSET        0x00A0 /* Source address register of DMA channel 5 */
#define DA1470_DMA_DMA5_B_START_OFFSET        0x00A4 /* Destination address register of DMA channel 5 */
#define DA1470_DMA_DMA5_CTRL_OFFSET           0x00B0 /* Control register of DMA channel 5 */
#define DA1470_DMA_DMA5_IDX_OFFSET            0x00B4 /* Index pointer register of DMA channel 5 */
#define DA1470_DMA_DMA5_INT_OFFSET            0x00A8 /* Interrupt length register of DMA channel 5 */
#define DA1470_DMA_DMA5_LEN_OFFSET            0x00AC /* Transfer length register of DMA channel 5 */
#define DA1470_DMA_DMA6_A_START_OFFSET        0x00C0 /* Source address register of DMA channel 6 */
#define DA1470_DMA_DMA6_B_START_OFFSET        0x00C4 /* Destination address register of DMA channel 6 */
#define DA1470_DMA_DMA6_CTRL_OFFSET           0x00D0 /* Control register of DMA channel 6 */
#define DA1470_DMA_DMA6_IDX_OFFSET            0x00D4 /* Index pointer register of DMA channel 6 */
#define DA1470_DMA_DMA6_INT_OFFSET            0x00C8 /* Interrupt length register of DMA channel 6 */
#define DA1470_DMA_DMA6_LEN_OFFSET            0x00CC /* Transfer length register of DMA channel 6 */
#define DA1470_DMA_DMA7_A_START_OFFSET        0x00E0 /* Source address register of DMA channel 7 */
#define DA1470_DMA_DMA7_B_START_OFFSET        0x00E4 /* Destination address register of DMA channel 7 */
#define DA1470_DMA_DMA7_CTRL_OFFSET           0x00F0 /* Control register of DMA channel 7 */
#define DA1470_DMA_DMA7_IDX_OFFSET            0x00F4 /* Index pointer register of DMA channel 7 */
#define DA1470_DMA_DMA7_INT_OFFSET            0x00E8 /* Interrupt length register of DMA channel 7 */
#define DA1470_DMA_DMA7_LEN_OFFSET            0x00EC /* Transfer length register of DMA channel 7 */
#define DA1470_DMA_DMA_CLEAR_INT_OFFSET       0x0108 /* DMA Interrupt clear register */
#define DA1470_DMA_DMA_INT_MASK_OFFSET        0x010C /* DMA Interrupt mask register */
#define DA1470_DMA_DMA_INT_STATUS_OFFSET      0x0104 /* DMA Interrupt status register */
#define DA1470_DMA_DMA_REQ_MUX_OFFSET         0x0100 /* DMA channels peripherals mapping register */
#define DA1470_DMA_DMA_RESET_INT_MASK_OFFSET  0x0114 /* DMA Reset Interrupt mask register */
#define DA1470_DMA_DMA_SET_INT_MASK_OFFSET    0x0110 /* DMA Set Interrupt mask register */

