AlmAck/svdtonuttx/demo/h/da1470_dma.h
/* Register addresses *******************************************************/

#define DA1470_DMA_BASE                       0x51000400 /* DMA registers */

#define DA1470_DMA_DMA0_A_START               (DA1470_DMA_BASE + DA1470_DMA_DMA0_A_START_OFFSET) /* Source address register of DMA channel 0 */
#define DA1470_DMA_DMA0_B_START               (DA1470_DMA_BASE + DA1470_DMA_DMA0_B_START_OFFSET) /* Destination address register of DMA channel 0 */
#define DA1470_DMA_DMA0_CTRL                  (DA1470_DMA_BASE + DA1470_DMA_DMA0_CTRL_OFFSET) /* Control register of DMA channel 0 */
#define DA1470_DMA_DMA0_IDX                   (DA1470_DMA_BASE + DA1470_DMA_DMA0_IDX_OFFSET) /* Index pointer register of DMA channel 0 */
#define DA1470_DMA_DMA0_INT                   (DA1470_DMA_BASE + DA1470_DMA_DMA0_INT_OFFSET) /* Interrupt length register of DMA channel 0 */
#define DA1470_DMA_DMA0_LEN                   (DA1470_DMA_BASE + DA1470_DMA_DMA0_LEN_OFFSET) /* Transfer length register of DMA channel 0 */
#define DA1470_DMA_DMA1_A_START               (DA1470_DMA_BASE + DA1470_DMA_DMA1_A_START_OFFSET) /* Source address register of DMA channel 1 */
#define DA1470_DMA_DMA1_B_START               (DA1470_DMA_BASE + DA1470_DMA_DMA1_B_START_OFFSET) /* Destination address register of DMA channel 1 */
#define DA1470_DMA_DMA1_CTRL                  (DA1470_DMA_BASE + DA1470_DMA_DMA1_CTRL_OFFSET) /* Control register of DMA channel 1 */
#define DA1470_DMA_DMA1_IDX                   (DA1470_DMA_BASE + DA1470_DMA_DMA1_IDX_OFFSET) /* Index pointer register of DMA channel 1 */
#define DA1470_DMA_DMA1_INT                   (DA1470_DMA_BASE + DA1470_DMA_DMA1_INT_OFFSET) /* Interrupt length register of DMA channel 1 */
#define DA1470_DMA_DMA1_LEN                   (DA1470_DMA_BASE + DA1470_DMA_DMA1_LEN_OFFSET) /* Transfer length register of DMA channel 1 */
#define DA1470_DMA_DMA2_A_START               (DA1470_DMA_BASE + DA1470_DMA_DMA2_A_START_OFFSET) /* Source address register of DMA channel 2 */
#define DA1470_DMA_DMA2_B_START               (DA1470_DMA_BASE + DA1470_DMA_DMA2_B_START_OFFSET) /* Destination address register of DMA channel 2 */
#define DA1470_DMA_DMA2_CTRL                  (DA1470_DMA_BASE + DA1470_DMA_DMA2_CTRL_OFFSET) /* Control register of DMA channel 2 */
#define DA1470_DMA_DMA2_IDX                   (DA1470_DMA_BASE + DA1470_DMA_DMA2_IDX_OFFSET) /* Index pointer register of DMA channel 2 */
#define DA1470_DMA_DMA2_INT                   (DA1470_DMA_BASE + DA1470_DMA_DMA2_INT_OFFSET) /* Interrupt length register of DMA channel 2 */
#define DA1470_DMA_DMA2_LEN                   (DA1470_DMA_BASE + DA1470_DMA_DMA2_LEN_OFFSET) /* Transfer length register of DMA channel 2 */
#define DA1470_DMA_DMA3_A_START               (DA1470_DMA_BASE + DA1470_DMA_DMA3_A_START_OFFSET) /* Source address register of DMA channel 3 */
#define DA1470_DMA_DMA3_B_START               (DA1470_DMA_BASE + DA1470_DMA_DMA3_B_START_OFFSET) /* Destination address register of DMA channel 3 */
#define DA1470_DMA_DMA3_CTRL                  (DA1470_DMA_BASE + DA1470_DMA_DMA3_CTRL_OFFSET) /* Control register of DMA channel 3 */
#define DA1470_DMA_DMA3_IDX                   (DA1470_DMA_BASE + DA1470_DMA_DMA3_IDX_OFFSET) /* Index pointer register of DMA channel 3 */
#define DA1470_DMA_DMA3_INT                   (DA1470_DMA_BASE + DA1470_DMA_DMA3_INT_OFFSET) /* Interrupt length register of DMA channel 3 */
#define DA1470_DMA_DMA3_LEN                   (DA1470_DMA_BASE + DA1470_DMA_DMA3_LEN_OFFSET) /* Transfer length register of DMA channel 3 */
#define DA1470_DMA_DMA4_A_START               (DA1470_DMA_BASE + DA1470_DMA_DMA4_A_START_OFFSET) /* Source address register of DMA channel 4 */
#define DA1470_DMA_DMA4_B_START               (DA1470_DMA_BASE + DA1470_DMA_DMA4_B_START_OFFSET) /* Destination address register of DMA channel 4 */
#define DA1470_DMA_DMA4_CTRL                  (DA1470_DMA_BASE + DA1470_DMA_DMA4_CTRL_OFFSET) /* Control register of DMA channel 4 */
#define DA1470_DMA_DMA4_IDX                   (DA1470_DMA_BASE + DA1470_DMA_DMA4_IDX_OFFSET) /* Index pointer register of DMA channel 4 */
#define DA1470_DMA_DMA4_INT                   (DA1470_DMA_BASE + DA1470_DMA_DMA4_INT_OFFSET) /* Interrupt length register of DMA channel 4 */
#define DA1470_DMA_DMA4_LEN                   (DA1470_DMA_BASE + DA1470_DMA_DMA4_LEN_OFFSET) /* Transfer length register of DMA channel 4 */
#define DA1470_DMA_DMA5_A_START               (DA1470_DMA_BASE + DA1470_DMA_DMA5_A_START_OFFSET) /* Source address register of DMA channel 5 */
#define DA1470_DMA_DMA5_B_START               (DA1470_DMA_BASE + DA1470_DMA_DMA5_B_START_OFFSET) /* Destination address register of DMA channel 5 */
#define DA1470_DMA_DMA5_CTRL                  (DA1470_DMA_BASE + DA1470_DMA_DMA5_CTRL_OFFSET) /* Control register of DMA channel 5 */
#define DA1470_DMA_DMA5_IDX                   (DA1470_DMA_BASE + DA1470_DMA_DMA5_IDX_OFFSET) /* Index pointer register of DMA channel 5 */
#define DA1470_DMA_DMA5_INT                   (DA1470_DMA_BASE + DA1470_DMA_DMA5_INT_OFFSET) /* Interrupt length register of DMA channel 5 */
#define DA1470_DMA_DMA5_LEN                   (DA1470_DMA_BASE + DA1470_DMA_DMA5_LEN_OFFSET) /* Transfer length register of DMA channel 5 */
#define DA1470_DMA_DMA6_A_START               (DA1470_DMA_BASE + DA1470_DMA_DMA6_A_START_OFFSET) /* Source address register of DMA channel 6 */
#define DA1470_DMA_DMA6_B_START               (DA1470_DMA_BASE + DA1470_DMA_DMA6_B_START_OFFSET) /* Destination address register of DMA channel 6 */
#define DA1470_DMA_DMA6_CTRL                  (DA1470_DMA_BASE + DA1470_DMA_DMA6_CTRL_OFFSET) /* Control register of DMA channel 6 */
#define DA1470_DMA_DMA6_IDX                   (DA1470_DMA_BASE + DA1470_DMA_DMA6_IDX_OFFSET) /* Index pointer register of DMA channel 6 */
#define DA1470_DMA_DMA6_INT                   (DA1470_DMA_BASE + DA1470_DMA_DMA6_INT_OFFSET) /* Interrupt length register of DMA channel 6 */
#define DA1470_DMA_DMA6_LEN                   (DA1470_DMA_BASE + DA1470_DMA_DMA6_LEN_OFFSET) /* Transfer length register of DMA channel 6 */
#define DA1470_DMA_DMA7_A_START               (DA1470_DMA_BASE + DA1470_DMA_DMA7_A_START_OFFSET) /* Source address register of DMA channel 7 */
#define DA1470_DMA_DMA7_B_START               (DA1470_DMA_BASE + DA1470_DMA_DMA7_B_START_OFFSET) /* Destination address register of DMA channel 7 */
#define DA1470_DMA_DMA7_CTRL                  (DA1470_DMA_BASE + DA1470_DMA_DMA7_CTRL_OFFSET) /* Control register of DMA channel 7 */
#define DA1470_DMA_DMA7_IDX                   (DA1470_DMA_BASE + DA1470_DMA_DMA7_IDX_OFFSET) /* Index pointer register of DMA channel 7 */
#define DA1470_DMA_DMA7_INT                   (DA1470_DMA_BASE + DA1470_DMA_DMA7_INT_OFFSET) /* Interrupt length register of DMA channel 7 */
#define DA1470_DMA_DMA7_LEN                   (DA1470_DMA_BASE + DA1470_DMA_DMA7_LEN_OFFSET) /* Transfer length register of DMA channel 7 */
#define DA1470_DMA_DMA_CLEAR_INT              (DA1470_DMA_BASE + DA1470_DMA_DMA_CLEAR_INT_OFFSET) /* DMA Interrupt clear register */
#define DA1470_DMA_DMA_INT_MASK               (DA1470_DMA_BASE + DA1470_DMA_DMA_INT_MASK_OFFSET) /* DMA Interrupt mask register */
#define DA1470_DMA_DMA_INT_STATUS             (DA1470_DMA_BASE + DA1470_DMA_DMA_INT_STATUS_OFFSET) /* DMA Interrupt status register */
#define DA1470_DMA_DMA_REQ_MUX                (DA1470_DMA_BASE + DA1470_DMA_DMA_REQ_MUX_OFFSET) /* DMA channels peripherals mapping register */
#define DA1470_DMA_DMA_RESET_INT_MASK         (DA1470_DMA_BASE + DA1470_DMA_DMA_RESET_INT_MASK_OFFSET) /* DMA Reset Interrupt mask register */
#define DA1470_DMA_DMA_SET_INT_MASK           (DA1470_DMA_BASE + DA1470_DMA_DMA_SET_INT_MASK_OFFSET) /* DMA Set Interrupt mask register */

/* Register bit definitions *************************************************/


/* DMA0_A_START Register */

#define DMA_DMA0_A_START_MASK                 (0xFFFFFFFF << 0) /* Source start address of channel 0 */
#define DMA_DMA0_A_START_POS                  (0) /* Source start address of channel 0 */

/* DMA0_B_START Register */

#define DMA_DMA0_B_START_MASK                 (0xFFFFFFFF << 0) /* Destination start address of channel 0 */
#define DMA_DMA0_B_START_POS                  (0) /* Destination start address of channel 0 */

/* DMA0_CTRL Register */

