AlmAck/svdtonuttx/demo/h/da1470_dma.h
/* DMA7_LEN Register */

#define DMA_DMA7_LEN_MASK                     (0xFFFF << 0) /* DMA channel's transfer length. DMA7_LEN of value 0, 1, 2, ... results into an ac */
#define DMA_DMA7_LEN_POS                      (0) /* DMA channel's transfer length. DMA7_LEN of value 0, 1, 2, ... results into an ac */

/* DMA_CLEAR_INT Register */

#define DMA_DMA_RST_IRQ_CH7                   (1U << 7) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 7 ; writ */
#define DMA_DMA_RST_IRQ_CH6                   (1U << 6) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 6 ; writ */
#define DMA_DMA_RST_IRQ_CH5                   (1U << 5) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 5 ; writ */
#define DMA_DMA_RST_IRQ_CH4                   (1U << 4) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 4 ; writ */
#define DMA_DMA_RST_IRQ_CH3                   (1U << 3) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 3 ; writ */
#define DMA_DMA_RST_IRQ_CH2                   (1U << 2) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 2 ; writ */
#define DMA_DMA_RST_IRQ_CH1                   (1U << 1) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 1 ; writ */
#define DMA_DMA_RST_IRQ_CH0                   (1U << 0) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 0 ; writ */

/* DMA_INT_MASK Register */

#define DMA_DMA_IRQ_ENABLE7                   (1U << 7) /* 0: disable interrupts on channel 7 1: enable interrupts on channel 7 */
#define DMA_DMA_IRQ_ENABLE6                   (1U << 6) /* 0: disable interrupts on channel 6 1: enable interrupts on channel 6 */
#define DMA_DMA_IRQ_ENABLE5                   (1U << 5) /* 0: disable interrupts on channel 5 1: enable interrupts on channel 5 */
#define DMA_DMA_IRQ_ENABLE4                   (1U << 4) /* 0: disable interrupts on channel 4 1: enable interrupts on channel 4 */
#define DMA_DMA_IRQ_ENABLE3                   (1U << 3) /* 0: disable interrupts on channel 3 1: enable interrupts on channel 3 */
#define DMA_DMA_IRQ_ENABLE2                   (1U << 2) /* 0: disable interrupts on channel 2 1: enable interrupts on channel 2 */
#define DMA_DMA_IRQ_ENABLE1                   (1U << 1) /* 0: disable interrupts on channel 1 1: enable interrupts on channel 1 */
#define DMA_DMA_IRQ_ENABLE0                   (1U << 0) /* 0: disable interrupts on channel 0 1: enable interrupts on channel 0 */

/* DMA_INT_STATUS Register */

#define DMA_DMA_BUS_ERR7                      (1U << 15) /* 0: No bus error response is detected for channel 7 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR6                      (1U << 14) /* 0: No bus error response is detected for channel 6 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR5                      (1U << 13) /* 0: No bus error response is detected for channel 5 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR4                      (1U << 12) /* 0: No bus error response is detected for channel 4 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR3                      (1U << 11) /* 0: No bus error response is detected for channel 3 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR2                      (1U << 10) /* 0: No bus error response is detected for channel 2 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR1                      (1U << 9) /* 0: No bus error response is detected for channel 1 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR0                      (1U << 8) /* 0: No bus error response is detected for channel 0 1: Bus error response detecte */
#define DMA_DMA_IRQ_CH7                       (1U << 7) /* 0: IRQ on channel 7 is not set 1: IRQ on channel 7 is set */
#define DMA_DMA_IRQ_CH6                       (1U << 6) /* 0: IRQ on channel 6 is not set 1: IRQ on channel 6 is set */
#define DMA_DMA_IRQ_CH5                       (1U << 5) /* 0: IRQ on channel 5 is not set 1: IRQ on channel 5 is set */
#define DMA_DMA_IRQ_CH4                       (1U << 4) /* 0: IRQ on channel 4 is not set 1: IRQ on channel 4 is set */
#define DMA_DMA_IRQ_CH3                       (1U << 3) /* 0: IRQ on channel 3 is not set 1: IRQ on channel 3 is set */
#define DMA_DMA_IRQ_CH2                       (1U << 2) /* 0: IRQ on channel 2 is not set 1: IRQ on channel 2 is set */
#define DMA_DMA_IRQ_CH1                       (1U << 1) /* 0: IRQ on channel 1 is not set 1: IRQ on channel 1 is set */
#define DMA_DMA_IRQ_CH0                       (1U << 0) /* 0: IRQ on channel 0 is not set 1: IRQ on channel 0 is set */

/* DMA_REQ_MUX Register */

#define DMA_DMA67_SEL_MASK                    (0xF << 12) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA67_SEL_POS                     (12) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA45_SEL_MASK                    (0xF << 8) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA45_SEL_POS                     (8) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA23_SEL_MASK                    (0xF << 4) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA23_SEL_POS                     (4) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA01_SEL_MASK                    (0xF << 0) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA01_SEL_POS                     (0) /* Select which combination of peripherals are mapped on the DMA channels. The peri */

/* DMA_RESET_INT_MASK Register */

#define DMA_DMA_RESET_IRQ_ENABLE7             (1U << 7) /* Writing a '1' will disable the IRQs in the DMA channel 7, writing a '0' has no e */
#define DMA_DMA_RESET_IRQ_ENABLE6             (1U << 6) /* Writing a '1' will disable the IRQs in the DMA channel 6, writing a '0' has no e */
#define DMA_DMA_RESET_IRQ_ENABLE5             (1U << 5) /* Writing a '1' will disable the IRQs in the DMA channel 5, writing a '0' has no e */
#define DMA_DMA_RESET_IRQ_ENABLE4             (1U << 4) /* Writing a '1' will disable the IRQs in the DMA channel 4, writing a '0' has no e */
#define DMA_DMA_RESET_IRQ_ENABLE3             (1U << 3) /* Writing a '1' will disable the IRQs in the DMA channel 3, writing a '0' has no e */
#define DMA_DMA_RESET_IRQ_ENABLE2             (1U << 2) /* Writing a '1' will disable the IRQs in the DMA channel 2, writing a '0' has no e */
#define DMA_DMA_RESET_IRQ_ENABLE1             (1U << 1) /* Writing a '1' will disable the IRQs in the DMA channel 1, writing a '0' has no e */
#define DMA_DMA_RESET_IRQ_ENABLE0             (1U << 0) /* Writing a '1' will disable the IRQs in the DMA channel 0, writing a '0' has no e */

/* DMA_SET_INT_MASK Register */

#define DMA_DMA_SET_IRQ_ENABLE7               (1U << 7) /* Writing a '1' will enable the IRQs in the DMA channel 7, writing a '0' has no ef */
#define DMA_DMA_SET_IRQ_ENABLE6               (1U << 6) /* Writing a '1' will enable the IRQs in the DMA channel 6, writing a '0' has no ef */
#define DMA_DMA_SET_IRQ_ENABLE5               (1U << 5) /* Writing a '1' will enable the IRQs in the DMA channel 5, writing a '0' has no ef */
#define DMA_DMA_SET_IRQ_ENABLE4               (1U << 4) /* Writing a '1' will enable the IRQs in the DMA channel 4, writing a '0' has no ef */
#define DMA_DMA_SET_IRQ_ENABLE3               (1U << 3) /* Writing a '1' will enable the IRQs in the DMA channel 3, writing a '0' has no ef */
#define DMA_DMA_SET_IRQ_ENABLE2               (1U << 2) /* Writing a '1' will enable the IRQs in the DMA channel 2, writing a '0' has no ef */
#define DMA_DMA_SET_IRQ_ENABLE1               (1U << 1) /* Writing a '1' will enable the IRQs in the DMA channel 1, writing a '0' has no ef */
#define DMA_DMA_SET_IRQ_ENABLE0               (1U << 0) /* Writing a '1' will enable the IRQs in the DMA channel 0, writing a '0' has no ef */

#endif /* __DA1470_DMA_H */
